Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70Q19.PIC
      <edc:SFRDef edc:_addr="0x40038200" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER4" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038204" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER5" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038208" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER6" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003820C" edc:access="------------wwww-www----wwwwwwww" edc:cname="USBHS_DEVEPTIER7" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXINES" edc:desc="Transmitted IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:desc="Received OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTPES" edc:desc="Received SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKOUTES" edc:desc="NAKed OUT Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKINES" edc:desc="NAKed IN Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLEDES" edc:desc="STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:desc="Kill IN Bank" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:desc="Endpoint Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:desc="NYET Token Disable Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:desc="Reset Data Toggle Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:desc="STALL Request Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
