Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70Q19.PIC
      <edc:SFRDef edc:_addr="0x400E181C" edc:access="-------------nnn-nnn----nnn-nnn-" edc:cname="SUPC_WUMR" edc:nzwidth="0x20" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="Supply Monitor Wake-up Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The supply monitor detection has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The supply monitor detection forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTTEN" edc:desc="Real-time Timer Wake-up Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The RTT alarm signal has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTT alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTCEN" edc:desc="Real-time Clock Wake-up Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The RTC alarm signal has no wake-up effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTC alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBCEN0" edc:desc="Low-power Debouncer Enable WKUP0" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP0 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP0 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCEN1" edc:desc="Low-power Debouncer Enable WKUP1" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The WKUP1 input pin is not connected to the low-power debouncer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The WKUP1 input pin is connected to the low-power debouncer and forces a system wake-up." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPDBCCLR" edc:desc="Low-power Debouncer Clear" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="A low-power debounce event does not create an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WKUPDBC" edc:desc="Wake-up Inputs Debouncer Period" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="IMMEDIATE" edc:desc="Immediate, no debouncing, detected active at least on one Slow Clock edge." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_3_SLCK" edc:desc="WKUPx shall be in its active state for at least 3 SLCK periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_SLCK" edc:desc="WKUPx shall be in its active state for at least 32 SLCK periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_512_SLCK" edc:desc="WKUPx shall be in its active state for at least 512 SLCK periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_4096_SLCK" edc:desc="WKUPx shall be in its active state for at least 4,096 SLCK periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_32768_SLCK" edc:desc="WKUPx shall be in its active state for at least 32,768 SLCK periods" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPDBC" edc:desc="Low-power Debouncer Period" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable the low-power debouncers." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_RTCOUT" edc:desc="WKUP0/1 in active state for at least 2 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_RTCOUT" edc:desc="WKUP0/1 in active state for at least 3 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_4_RTCOUT" edc:desc="WKUP0/1 in active state for at least 4 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_5_RTCOUT" edc:desc="WKUP0/1 in active state for at least 5 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_6_RTCOUT" edc:desc="WKUP0/1 in active state for at least 6 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_7_RTCOUT" edc:desc="WKUP0/1 in active state for at least 7 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_RTCOUT" edc:desc="WKUP0/1 in active state for at least 8 RTCOUTx clock periods" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
